[
    {
        "tag": "definisi_insomnia",
        "pattern": [
            "Apa itu insomnia?",
            "Bagaimana mendefinisikan insomnia?",
            "Apa yang dimaksud dengan insomnia?",
            "Jelaskan pengertian insomnia.",
            "Insomnia itu apa?",
            "insomnia?",
            "Apa yang dimaksud dengan insomnia?",
            "insomnia maksudnya?",
            "Apa arti istilah insomnia?",
            "insomnia aja deh.",
            "Bisakah Anda menjelaskan tentang insomnia?",
            "Gue gak ngerti insomnia, maksudnya apa?",
            "Boleh dong jelasin insomnia pake bahasa gampang.",
            "Coba jelasin deh insomnia.",
            "Jadi gini, insomnia tuh apa ya?",
            "Apa definisi dari insomnia?",
            "insomnia, penjelasan?",
            "insomnia itu apaan sih?",
            "Tentang insomnia?",
            "Tolong uraikan pengertian insomnia."
        ],
        "response": [
            "Insomnia adalah gangguan tidur yang ditandai dengan kesulitan untuk memulai atau mempertahankan tidur.",
            "Insomnia merupakan kondisi di mana seseorang mengalami kesulitan tidur atau tidur yang tidak nyenyak.",
            "Definisi insomnia adalah gangguan tidur yang menyebabkan kurangnya kualitas dan kuantitas tidur.",
            "Insomnia berarti kesulitan tidur atau sering terbangun di malam hari sehingga mengganggu aktivitas siang hari.",
            "Secara medis, insomnia adalah kondisi dimana seseorang sulit untuk mendapatkan tidur yang cukup dan berkualitas."
        ]
    },
    {
        "tag": "definisi_cbt_i",
        "pattern": [
            "Apa itu Cognitive Behavioral Therapy for Insomnia?",
            "Apa itu CBT?",
            "Bagaimana mendefinisikan Cognitive Behavioral Therapy for Insomnia?",
            "Jelaskan Cognitive Behavioral Therapy for Insomnia dalam pengobatan insomnia.",
            "Jelaskan CBT dalam pengobatan insomnia.",
            "Apa yang dimaksud dengan terapi CBT-I untuk insomnia?",
            "Apa yang dimaksud dengan terapi CBT untuk insomnia?",
            "Apa peran CBT dalam mengatasi insomnia?",
            "Apa peran Cognitive Behavioral Therapy for Insomnia dalam mengatasi insomnia?",
            "Apa yang dimaksud dengan CBT-I?",
            "CBT-I, penjelasan?",
            "Apa arti istilah Cognitive Behavioral Therapy for Insomnia?",
            "Coba jelasin deh CBT-I.",
            "Tentang Cognitive Behavioral Therapy for Insomnia?",
            "Gue gak ngerti CBT-I, maksudnya apa?",
            "CBT-I maksudnya?",
            "Boleh dong jelasin Cognitive Behavioral Therapy for Insomnia pake bahasa gampang.",
            "CBT-I aja deh.",
            "CBT-I?",
            "Jadi gini, CBT-I tuh apa ya?"
        ],
        "response": [
            "CBT-I adalah terapi perilaku kognitif yang fokus pada mengubah pola pikir dan perilaku yang mengganggu tidur.",
            "CBT-I merupakan pendekatan non-farmakologis untuk mengatasi insomnia melalui perubahan perilaku dan kognitif.",
            "Terapi CBT-I membantu mengidentifikasi dan mengubah pikiran serta kebiasaan yang menyebabkan gangguan tidur.",
            "CBT-I adalah metode terapi yang digunakan untuk memperbaiki kualitas tidur melalui teknik-teknik kognitif dan perilaku."
        ]
    },
    {
        "tag": "definisi_act",
        "pattern": [
            "Apa itu Acceptance and Commitment Therapy?",
            "Bagaimana mendefinisikan Acceptance and Commitment Therapy?",
            "Jelaskan pengertian Acceptance and Commitment Therapy dalam terapi insomnia.",
            "Apa yang dimaksud dengan ACT dalam konteks pengobatan insomnia?",
            "Apa peran Acceptance and Commitment Therapy dalam mengatasi masalah tidur?",
            "ACT itu apaan sih?",
            "ACT?",
            "Bisakah Anda menjelaskan tentang Acceptance and Commitment Therapy?",
            "Apa definisi dari ACT?",
            "ACT maksudnya?",
            "Boleh dong jelasin Acceptance and Commitment Therapy pake bahasa gampang.",
            "ACT aja deh.",
            "Apa arti istilah Acceptance and Commitment Therapy?",
            "Apa yang dimaksud dengan ACT?",
            "Tentang Acceptance and Commitment Therapy?",
            "Tolong uraikan pengertian ACT.",
            "Gue gak ngerti ACT, maksudnya apa?",
            "Acceptance and Commitment Therapy, penjelasan?",
            "Jadi gini, ACT tuh apa ya?",
            "Coba jelasin deh Acceptance and Commitment Therapy."
        ],
        "response": [
            "ACT adalah terapi yang menekankan penerimaan, mindfulness, dan komitmen untuk perubahan perilaku yang sesuai dengan nilai-nilai pribadi.",
            "Acceptance and Commitment Therapy (ACT) adalah pendekatan terapi yang membantu individu menerima pengalaman internal dan berkomitmen pada tindakan yang bermakna.",
            "ACT mengajarkan pasien untuk menerima pikiran dan emosi negatif tanpa berusaha mengubahnya, serta fokus pada tindakan yang mendukung nilai-nilai mereka.",
            "Dalam konteks insomnia, ACT digunakan untuk mengurangi perjuangan melawan gejala tidur dengan meningkatkan fleksibilitas psikologis.",
            "ACT adalah terapi yang mengintegrasikan mindfulness dan penerimaan untuk membantu mengatasi gangguan tidur."
        ]
    },
    {
        "tag": "perbandingan_act_cbt_i",
        "pattern": [
            "Apa perbedaan antara ACT dan CBT-I?",
            "Bagaimana perbandingan antara ACT dan CBT-I dalam mengobati insomnia?",
            "Jelaskan perbedaan utama antara terapi ACT dan CBT-I.",
            "Apa yang membedakan ACT dengan CBT-I?",
            "Bagaimana ACT berbeda dari CBT-I dalam pengobatan insomnia?",
            "perbedaan ACT dan CBT-I?",
            "perbedaan ACT dan CBT-I aja deh.",
            "Gue gak ngerti perbedaan ACT dan CBT-I, maksudnya apa?",
            "perbedaan ACT dan CBT-I itu apaan sih?",
            "Apa yang dimaksud dengan perbedaan ACT dan CBT-I?",
            "Tentang perbedaan ACT dan CBT-I?",
            "perbedaan ACT dan CBT-I, penjelasan?",
            "Apa arti istilah perbedaan ACT dan CBT-I?",
            "Apa definisi dari perbedaan ACT dan CBT-I?",
            "Boleh dong jelasin perbedaan ACT dan CBT-I pake bahasa gampang.",
            "Coba jelasin deh perbedaan ACT dan CBT-I.",
            "perbedaan ACT dan CBT-I maksudnya?",
            "Bisakah Anda menjelaskan tentang perbedaan ACT dan CBT-I?",
            "Tolong uraikan pengertian perbedaan ACT dan CBT-I.",
            "Jadi gini, perbedaan ACT dan CBT-I tuh apa ya?"
        ],
        "response": [
            "CBT-I fokus pada mengubah pikiran dan perilaku negatif, sedangkan ACT menekankan penerimaan dan komitmen terhadap nilai-nilai pribadi.",
            "Perbedaan utamanya, CBT-I mencoba merestrukturisasi pikiran, sementara ACT mendorong penerimaan atas pengalaman negatif.",
            "Dalam CBT-I, tujuan utamanya adalah mengubah kebiasaan tidur, sedangkan ACT lebih menekankan penerimaan emosi dan pengalaman tanpa penilaian.",
            "CBT-I berfokus pada restrukturisasi kognitif, sedangkan ACT menggunakan teknik mindfulness dan penerimaan untuk meningkatkan kualitas tidur.",
            "Meskipun keduanya sama-sama digunakan untuk mengatasi insomnia, ACT lebih mengedepankan penerimaan dan komitmen daripada perubahan pikiran secara langsung."
        ]
    },
    {
        "tag": "komponen_cbt_i",
        "pattern": [
            "Apa saja komponen utama dalam CBT-I?",
            "Sebutkan komponen utama terapi CBT-I.",
            "Komponen apa saja yang terdapat dalam CBT-I?",
            "Jelaskan elemen-elemen dasar CBT-I.",
            "Apa yang termasuk dalam pendekatan CBT-I?",
            "komponen CBT-I aja deh.",
            "Apa definisi dari komponen CBT-I?",
            "komponen CBT-I, penjelasan?",
            "Boleh dong jelasin komponen CBT-I pake bahasa gampang.",
            "Tolong uraikan pengertian komponen CBT-I.",
            "komponen CBT-I?",
            "Coba jelasin deh komponen CBT-I.",
            "Bisakah Anda menjelaskan tentang komponen CBT-I?",
            "Jadi gini, komponen CBT-I tuh apa ya?",
            "komponen CBT-I itu apaan sih?",
            "Gue gak ngerti komponen CBT-I, maksudnya apa?",
            "Apa arti istilah komponen CBT-I?",
            "Tentang komponen CBT-I?",
            "komponen CBT-I maksudnya?",
            "Apa yang dimaksud dengan komponen CBT-I?"
        ],
        "response": [
            "CBT-I mencakup edukasi tentang tidur, stimulus control, sleep restriction, sleep hygiene, dan terapi kognitif.",
            "Komponen utama CBT-I meliputi pengaturan pola tidur, pengendalian lingkungan tidur, dan perubahan pikiran negatif.",
            "Dalam CBT-I terdapat teknik sleep restriction, stimulus control, dan penerapan sleep hygiene untuk meningkatkan kualitas tidur.",
            "Elemen dasar CBT-I antara lain edukasi tentang tidur, penyesuaian perilaku tidur, dan restrukturisasi kognitif.",
            "Pendekatan CBT-I melibatkan intervensi perilaku dan kognitif seperti sleep restriction, stimulus control, dan perubahan kebiasaan tidur."
        ]
    },
    {
        "tag": "komponen_act",
        "pattern": [
            "Apa saja komponen utama dalam ACT?",
            "Sebutkan elemen-elemen utama dalam terapi ACT.",
            "Komponen apa yang ada dalam ACT?",
            "Jelaskan komponen dasar dari ACT.",
            "Apa saja aspek yang dibahas dalam ACT?",
            "Tolong uraikan pengertian komponen ACT.",
            "Apa arti istilah komponen ACT?",
            "Coba jelasin deh komponen ACT.",
            "komponen ACT?",
            "Apa definisi dari komponen ACT?",
            "Bisakah Anda menjelaskan tentang komponen ACT?",
            "komponen ACT itu apaan sih?",
            "Jadi gini, komponen ACT tuh apa ya?",
            "komponen ACT maksudnya?",
            "Tentang komponen ACT?",
            "Gue gak ngerti komponen ACT, maksudnya apa?",
            "Apa yang dimaksud dengan komponen ACT?",
            "komponen ACT aja deh.",
            "Boleh dong jelasin komponen ACT pake bahasa gampang.",
            "komponen ACT, penjelasan?"
        ],
        "response": [
            "ACT terdiri dari enam komponen: present moment focus, acceptance, values, cognitive defusion, self as context, dan committed action.",
            "Elemen utama ACT meliputi mindfulness, penerimaan, defusi kognitif, klarifikasi nilai, dan tindakan komitmen.",
            "Dalam ACT, pasien diajarkan untuk fokus pada saat ini, menerima pengalaman internal, dan berkomitmen pada nilai-nilai pribadi.",
            "Komponen dasar ACT mencakup kesadaran penuh, penerimaan, identifikasi nilai, pemisahan dari pikiran, dan tindakan berdasarkan nilai.",
            "ACT mengintegrasikan mindfulness, penerimaan, nilai-nilai, defusi kognitif, identitas diri, dan tindakan yang konsisten dengan nilai."
        ]
    },
    {
        "tag": "sleep_restriction",
        "pattern": [
            "Apa yang dimaksud dengan sleep restriction?",
            "Jelaskan konsep sleep restriction dalam terapi insomnia.",
            "Apa itu sleep restriction dan bagaimana cara kerjanya?",
            "Bagaimana sleep restriction membantu mengatasi insomnia?",
            "Jelaskan tentang sleep restriction.",
            "Boleh dong jelasin sleep restriction pake bahasa gampang.",
            "Tolong uraikan pengertian sleep restriction.",
            "sleep restriction aja deh.",
            "sleep restriction?",
            "sleep restriction, penjelasan?",
            "Apa yang dimaksud dengan sleep restriction?",
            "Apa arti istilah sleep restriction?",
            "sleep restriction itu apaan sih?",
            "Gue gak ngerti sleep restriction, maksudnya apa?",
            "Tentang sleep restriction?",
            "sleep restriction maksudnya?",
            "Coba jelasin deh sleep restriction.",
            "Bisakah Anda menjelaskan tentang sleep restriction?",
            "Apa definisi dari sleep restriction?",
            "Jadi gini, sleep restriction tuh apa ya?"
        ],
        "response": [
            "Sleep restriction adalah teknik mengurangi waktu di tempat tidur agar lebih sesuai dengan waktu tidur yang sebenarnya, untuk meningkatkan efisiensi tidur.",
            "Konsep sleep restriction melibatkan pembatasan waktu di tempat tidur sehingga meningkatkan kebutuhan tidur pada waktu yang tepat.",
            "Sleep restriction bertujuan mengkonsolidasikan tidur dengan membatasi waktu yang dihabiskan di tempat tidur, sehingga meningkatkan kualitas tidur.",
            "Dengan sleep restriction, waktu tidur diatur agar sesuai dengan waktu tidur efektif, sehingga membantu mengurangi waktu terjaga di malam hari.",
            "Sleep restriction adalah metode untuk membatasi waktu tidur, sehingga meningkatkan tekanan tidur dan kualitas tidur secara keseluruhan."
        ]
    },
    {
        "tag": "stimulus_control",
        "pattern": [
            "Apa yang dimaksud dengan stimulus control dalam terapi tidur?",
            "Jelaskan konsep stimulus control untuk mengatasi insomnia.",
            "Apa pengertian stimulus control dalam terapi Insomnia?",
            "Bagaimana stimulus control membantu memperbaiki pola tidur?",
            "Apa yang dimaksud dengan stimulus control dalam pengobatan insomnia?",
            "stimulus control maksudnya?",
            "Boleh dong jelasin stimulus control pake bahasa gampang.",
            "Apa definisi dari stimulus control?",
            "stimulus control?",
            "stimulus control aja deh.",
            "Apa arti istilah stimulus control?",
            "Jadi gini, stimulus control tuh apa ya?",
            "Tentang stimulus control?",
            "Gue gak ngerti stimulus control, maksudnya apa?",
            "Coba jelasin deh stimulus control.",
            "Bisakah Anda menjelaskan tentang stimulus control?",
            "Apa yang dimaksud dengan stimulus control?",
            "stimulus control itu apaan sih?",
            "stimulus control, penjelasan?",
            "Tolong uraikan pengertian stimulus control."
        ],
        "response": [
            "Stimulus control adalah teknik untuk mengasosiasikan tempat tidur hanya dengan tidur, dengan menghindari aktivitas yang mengganggu di tempat tidur.",
            "Konsep stimulus control melibatkan penggunaan tempat tidur hanya untuk tidur dan aktivitas intim, untuk mengurangi asosiasi negatif.",
            "Stimulus control bertujuan menciptakan hubungan yang kuat antara tempat tidur dan tidur, dengan menghindari kegiatan yang mengganggu di kamar tidur.",
            "Dalam stimulus control, pasien dianjurkan untuk bangun dari tempat tidur jika tidak dapat tidur, sehingga menguatkan asosiasi tidur.",
            "Stimulus control membantu mengurangi kondisi di mana tempat tidur terasosiasi dengan kegelisahan, dengan memfokuskan penggunaannya hanya untuk tidur."
        ]
    },
    {
        "tag": "experiential_avoidance",
        "pattern": [
            "Apa yang dimaksud dengan experiential avoidance?",
            "Jelaskan konsep experiential avoidance dalam konteks insomnia.",
            "Apa pengertian experiential avoidance?",
            "Bagaimana experiential avoidance mempengaruhi tidur?",
            "Apa arti experiential avoidance dalam terapi insomnia?",
            "Apa arti istilah experiential avoidance?",
            "Apa yang dimaksud dengan experiential avoidance?",
            "experiential avoidance aja deh.",
            "experiential avoidance maksudnya?",
            "Apa definisi dari experiential avoidance?",
            "Gue gak ngerti experiential avoidance, maksudnya apa?",
            "Jadi gini, experiential avoidance tuh apa ya?",
            "experiential avoidance itu apaan sih?",
            "Boleh dong jelasin experiential avoidance pake bahasa gampang.",
            "Tolong uraikan pengertian experiential avoidance.",
            "Bisakah Anda menjelaskan tentang experiential avoidance?",
            "Tentang experiential avoidance?",
            "Coba jelasin deh experiential avoidance.",
            "experiential avoidance?",
            "experiential avoidance, penjelasan?"
        ],
        "response": [
            "Experiential avoidance adalah kecenderungan untuk menghindari atau melawan pengalaman internal yang tidak menyenangkan, seperti pikiran atau emosi negatif.",
            "Konsep experiential avoidance merujuk pada usaha untuk menghindari pengalaman batin yang tidak nyaman, yang justru dapat memperburuk insomnia.",
            "Experiential avoidance berarti menghindari pengalaman internal yang negatif, yang dapat meningkatkan kecemasan dan mengganggu tidur.",
            "Dengan menghindari pengalaman internal yang tidak menyenangkan, individu cenderung mengalami peningkatan kecemasan yang dapat mempengaruhi kualitas tidur.",
            "Experiential avoidance adalah upaya untuk menghindari pikiran dan perasaan negatif, yang sering kali menjadi penghalang dalam mengatasi masalah tidur."
        ]
    },
    {
        "tag": "cognitive_defusion",
        "pattern": [
            "Apa itu cognitive defusion?",
            "Jelaskan pengertian cognitive defusion dalam ACT.",
            "Apa yang dimaksud dengan cognitive defusion?",
            "Bagaimana cognitive defusion membantu mengatasi insomnia?",
            "Apa arti cognitive defusion dalam terapi ACT?",
            "Apa yang dimaksud dengan cognitive defusion?",
            "Coba jelasin deh cognitive defusion.",
            "Gue gak ngerti cognitive defusion, maksudnya apa?",
            "cognitive defusion aja deh.",
            "Apa definisi dari cognitive defusion?",
            "cognitive defusion maksudnya?",
            "Jadi gini, cognitive defusion tuh apa ya?",
            "Tolong uraikan pengertian cognitive defusion.",
            "Bisakah Anda menjelaskan tentang cognitive defusion?",
            "cognitive defusion, penjelasan?",
            "Apa arti istilah cognitive defusion?",
            "Tentang cognitive defusion?",
            "cognitive defusion?",
            "Boleh dong jelasin cognitive defusion pake bahasa gampang.",
            "cognitive defusion itu apaan sih?"
        ],
        "response": [
            "Cognitive defusion adalah proses memisahkan diri dari pikiran sehingga tidak terlalu terikat pada mereka.",
            "Dalam ACT, cognitive defusion berarti belajar untuk melihat pikiran sebagai kejadian mental, bukan kebenaran mutlak.",
            "Cognitive defusion membantu pasien menyadari bahwa pikiran hanyalah pikiran, sehingga tidak perlu direspons secara berlebihan.",
            "Proses cognitive defusion memungkinkan individu untuk tidak terjebak dalam pikiran negatif yang dapat mengganggu tidur.",
            "Cognitive defusion adalah teknik untuk mengurangi dampak pikiran negatif dengan menganggapnya sebagai peristiwa mental semata."
        ]
    },
    {
        "tag": "mindfulness_treatment",
        "pattern": [
            "Bagaimana peran mindfulness dalam terapi insomnia?",
            "Apa manfaat mindfulness untuk mengatasi insomnia?",
            "Jelaskan penggunaan mindfulness dalam pengobatan insomnia.",
            "Bagaimana mindfulness membantu meningkatkan kualitas tidur?",
            "Apa peran mindfulness dalam terapi ACT untuk insomnia?",
            "Coba jelasin deh mindfulness dalam insomnia.",
            "Apa arti istilah mindfulness dalam insomnia?",
            "mindfulness dalam insomnia aja deh.",
            "mindfulness dalam insomnia maksudnya?",
            "mindfulness dalam insomnia?",
            "Apa definisi dari mindfulness dalam insomnia?",
            "Gue gak ngerti mindfulness dalam insomnia, maksudnya apa?",
            "Tentang mindfulness dalam insomnia?",
            "Tolong uraikan pengertian mindfulness dalam insomnia.",
            "mindfulness dalam insomnia itu apaan sih?",
            "Bisakah Anda menjelaskan tentang mindfulness dalam insomnia?",
            "Boleh dong jelasin mindfulness dalam insomnia pake bahasa gampang.",
            "mindfulness dalam insomnia, penjelasan?",
            "Jadi gini, mindfulness dalam insomnia tuh apa ya?",
            "Apa yang dimaksud dengan mindfulness dalam insomnia?"
        ],
        "response": [
            "Mindfulness membantu meningkatkan kesadaran pada saat ini dan mengurangi kecemasan yang dapat mengganggu tidur.",
            "Melalui mindfulness, pasien dapat lebih menerima pikiran dan emosi, sehingga tidur menjadi lebih nyenyak.",
            "Mindfulness dalam terapi membantu individu fokus pada saat ini, mengurangi kekhawatiran berlebihan yang mengganggu tidur.",
            "Dengan melatih mindfulness, pasien belajar untuk melepaskan kecemasan dan stres yang sering menjadi penyebab insomnia.",
            "Peran mindfulness dalam ACT adalah membantu mengurangi overthinking sehingga meningkatkan kualitas tidur."
        ]
    },
    {
        "tag": "peran_sleep_diary",
        "pattern": [
            "Apa fungsi sleep diary dalam diagnosis insomnia?",
            "Bagaimana sleep diary membantu mengevaluasi kualitas tidur?",
            "Jelaskan manfaat sleep diary untuk pasien insomnia.",
            "Mengapa sleep diary penting dalam pengobatan insomnia?",
            "Apa peran sleep diary dalam penilaian gangguan tidur?",
            "Coba jelasin deh sleep diary.",
            "sleep diary?",
            "Apa arti istilah sleep diary?",
            "sleep diary maksudnya?",
            "Bisakah Anda menjelaskan tentang sleep diary?",
            "sleep diary aja deh.",
            "Jadi gini, sleep diary tuh apa ya?",
            "Apa yang dimaksud dengan sleep diary?",
            "Tolong uraikan pengertian sleep diary.",
            "Apa definisi dari sleep diary?",
            "Tentang sleep diary?",
            "Gue gak ngerti sleep diary, maksudnya apa?",
            "Boleh dong jelasin sleep diary pake bahasa gampang.",
            "sleep diary itu apaan sih?",
            "sleep diary, penjelasan?"
        ],
        "response": [
            "Sleep diary membantu merekam pola tidur harian untuk mengidentifikasi masalah dan perkembangan tidur.",
            "Dengan sleep diary, pasien dan dokter dapat memantau durasi dan kualitas tidur secara akurat.",
            "Sleep diary berfungsi sebagai alat untuk mengamati kebiasaan tidur dan menentukan intervensi yang tepat.",
            "Melalui sleep diary, informasi mengenai waktu tidur, bangun, dan gangguan tidur dapat dikumpulkan untuk evaluasi.",
            "Sleep diary merupakan alat penting dalam diagnosis insomnia karena membantu memetakan pola tidur pasien."
        ]
    },
    {
        "tag": "diagnosis_insomnia",
        "pattern": [
            "Apa saja kriteria diagnosis insomnia?",
            "Bagaimana cara mendiagnosis insomnia?",
            "Jelaskan kriteria untuk diagnosis insomnia.",
            "Apa yang harus dipenuhi untuk didiagnosis insomnia?",
            "Bagaimana proses diagnosis insomnia dilakukan?",
            "Tentang diagnosis insomnia?",
            "Coba jelasin deh diagnosis insomnia.",
            "Apa definisi dari diagnosis insomnia?",
            "Apa arti istilah diagnosis insomnia?",
            "diagnosis insomnia, penjelasan?",
            "Boleh dong jelasin diagnosis insomnia pake bahasa gampang.",
            "diagnosis insomnia?",
            "Tolong uraikan pengertian diagnosis insomnia.",
            "diagnosis insomnia maksudnya?",
            "diagnosis insomnia aja deh.",
            "Jadi gini, diagnosis insomnia tuh apa ya?",
            "diagnosis insomnia itu apaan sih?",
            "Gue gak ngerti diagnosis insomnia, maksudnya apa?",
            "Bisakah Anda menjelaskan tentang diagnosis insomnia?",
            "Apa yang dimaksud dengan diagnosis insomnia?"
        ],
        "response": [
            "Diagnosis insomnia melibatkan evaluasi keluhan tidur, penggunaan sleep diary, dan pemeriksaan klinis.",
            "Untuk mendiagnosis insomnia, dokter mengumpulkan riwayat tidur, menggunakan kuesioner, dan melakukan wawancara klinis.",
            "Kriteria diagnosis meliputi kesulitan tidur minimal tiga kali seminggu selama setidaknya tiga bulan, dengan gangguan pada aktivitas siang hari.",
            "Diagnosis insomnia dilakukan melalui wawancara, pemeriksaan riwayat tidur, dan penilaian dampak pada fungsi sehari-hari.",
            "Untuk diagnosis insomnia, perlu evaluasi gejala, durasi gangguan, dan pengaruhnya terhadap kualitas hidup pasien."
        ]
    },
    {
        "tag": "diagnostic_tools",
        "pattern": [
            "Apa saja alat yang digunakan untuk mendiagnosis insomnia?",
            "Sebutkan alat diagnosis insomnia yang umum digunakan.",
            "Jelaskan peran sleep diary dan kuesioner dalam diagnosis insomnia.",
            "Alat apa yang digunakan untuk menilai insomnia?",
            "Bagaimana cara menilai insomnia dengan alat diagnostik?",
            "alat diagnosis insomnia aja deh.",
            "Jadi gini, alat diagnosis insomnia tuh apa ya?",
            "alat diagnosis insomnia itu apaan sih?",
            "Apa yang dimaksud dengan alat diagnosis insomnia?",
            "Coba jelasin deh alat diagnosis insomnia.",
            "Tolong uraikan pengertian alat diagnosis insomnia.",
            "Apa arti istilah alat diagnosis insomnia?",
            "Boleh dong jelasin alat diagnosis insomnia pake bahasa gampang.",
            "Tentang alat diagnosis insomnia?",
            "alat diagnosis insomnia maksudnya?",
            "Apa definisi dari alat diagnosis insomnia?",
            "alat diagnosis insomnia?",
            "alat diagnosis insomnia, penjelasan?",
            "Gue gak ngerti alat diagnosis insomnia, maksudnya apa?",
            "Bisakah Anda menjelaskan tentang alat diagnosis insomnia?"
        ],
        "response": [
            "Alat diagnosis meliputi sleep diary, kuesioner seperti ISI dan PSQI, serta pemeriksaan fisik.",
            "Sleep diary, kuesioner insomnia, dan kadang actigraphy merupakan alat yang digunakan untuk menilai insomnia.",
            "Diagnosis insomnia biasanya menggunakan sleep diary, kuesioner, dan wawancara klinis untuk mengumpulkan data.",
            "Alat yang umum digunakan adalah kuesioner seperti Insomnia Severity Index (ISI) dan sleep diary untuk memantau pola tidur.",
            "Sleep diary dan kuesioner seperti PSQI adalah metode standar dalam mengevaluasi gangguan tidur pada pasien."
        ]
    },
    {
        "tag": "pharmacological_treatment",
        "pattern": [
            "Apa saja pengobatan farmakologis untuk insomnia?",
            "Sebutkan obat-obatan yang digunakan untuk mengatasi insomnia.",
            "Jelaskan pengobatan obat tidur untuk insomnia.",
            "Apa yang dimaksud dengan pengobatan farmakologis untuk insomnia?",
            "Obat apa saja yang direkomendasikan untuk insomnia?",
            "Apa definisi dari obat insomnia?",
            "Tolong uraikan pengertian obat insomnia.",
            "obat insomnia itu apaan sih?",
            "obat insomnia aja deh.",
            "Gue gak ngerti obat insomnia, maksudnya apa?",
            "obat insomnia, penjelasan?",
            "Boleh dong jelasin obat insomnia pake bahasa gampang.",
            "Apa yang dimaksud dengan obat insomnia?",
            "Apa arti istilah obat insomnia?",
            "obat insomnia?",
            "Tentang obat insomnia?",
            "obat insomnia maksudnya?",
            "Bisakah Anda menjelaskan tentang obat insomnia?",
            "Coba jelasin deh obat insomnia.",
            "Jadi gini, obat insomnia tuh apa ya?"
        ],
        "response": [
            "Pengobatan farmakologis meliputi benzodiazepin, benzodiazepine receptor agonists, dan melatonin.",
            "Obat-obatan yang digunakan termasuk orexin receptor antagonists, sedatif, dan melatonin dosis rendah.",
            "Pengobatan obat tidur untuk insomnia umumnya menggunakan benzodiazepin dan obat lain yang direkomendasikan untuk jangka pendek.",
            "Obat farmakologis seperti daridorexant dan melatonin digunakan untuk mengatasi insomnia pada beberapa pasien.",
            "Pengobatan farmakologis untuk insomnia meliputi obat-obatan yang diresepkan untuk penggunaan jangka pendek guna menghindari ketergantungan."
        ]
    },
    {
        "tag": "sleep_hygiene",
        "pattern": [
            "Apa itu sleep hygiene?",
            "Jelaskan konsep sleep hygiene dalam pengobatan insomnia.",
            "Apa yang dimaksud dengan sleep hygiene?",
            "Bagaimana sleep hygiene dapat membantu mengatasi insomnia?",
            "Apa peran sleep hygiene dalam terapi insomnia?",
            "Tolong uraikan pengertian sleep hygiene.",
            "Tentang sleep hygiene?",
            "Bisakah Anda menjelaskan tentang sleep hygiene?",
            "sleep hygiene?",
            "Gue gak ngerti sleep hygiene, maksudnya apa?",
            "Jadi gini, sleep hygiene tuh apa ya?",
            "sleep hygiene aja deh.",
            "Apa yang dimaksud dengan sleep hygiene?",
            "sleep hygiene maksudnya?",
            "Coba jelasin deh sleep hygiene.",
            "Boleh dong jelasin sleep hygiene pake bahasa gampang.",
            "Apa definisi dari sleep hygiene?",
            "sleep hygiene itu apaan sih?",
            "Apa arti istilah sleep hygiene?",
            "sleep hygiene, penjelasan?"
        ],
        "response": [
            "Sleep hygiene adalah kebiasaan dan lingkungan yang mendukung tidur yang berkualitas.",
            "Sleep hygiene melibatkan rutinitas tidur yang konsisten, lingkungan tidur yang nyaman, dan menghindari stimulan sebelum tidur.",
            "Konsep sleep hygiene mencakup kebiasaan seperti menjaga waktu tidur yang teratur dan menghindari kafein menjelang tidur.",
            "Sleep hygiene membantu dengan menciptakan lingkungan dan pola hidup yang kondusif untuk tidur yang nyenyak.",
            "Melalui sleep hygiene, pasien diharapkan memiliki kebiasaan yang mendukung tidur yang lebih baik dan berkualitas."
        ]
    },
    {
        "tag": "dampak_insomnia",
        "pattern": [
            "Apa dampak insomnia terhadap kualitas hidup?",
            "Bagaimana insomnia mempengaruhi aktivitas sehari-hari?",
            "Jelaskan efek insomnia pada fungsi kognitif dan emosional.",
            "Apa saja konsekuensi dari insomnia?",
            "Bagaimana insomnia berdampak pada kesehatan secara umum?",
            "dampak insomnia?",
            "Apa yang dimaksud dengan dampak insomnia?",
            "Bisakah Anda menjelaskan tentang dampak insomnia?",
            "Boleh dong jelasin dampak insomnia pake bahasa gampang.",
            "Tentang dampak insomnia?",
            "Tolong uraikan pengertian dampak insomnia.",
            "dampak insomnia aja deh.",
            "Coba jelasin deh dampak insomnia.",
            "dampak insomnia, penjelasan?",
            "Apa definisi dari dampak insomnia?",
            "Jadi gini, dampak insomnia tuh apa ya?",
            "Gue gak ngerti dampak insomnia, maksudnya apa?",
            "Apa arti istilah dampak insomnia?",
            "dampak insomnia maksudnya?",
            "dampak insomnia itu apaan sih?"
        ],
        "response": [
            "Insomnia dapat mengurangi kualitas hidup dengan menurunkan fungsi kognitif, mood, dan produktivitas.",
            "Dampak insomnia meliputi kelelahan, kesulitan berkonsentrasi, dan penurunan performa kerja.",
            "Insomnia berdampak negatif pada kesehatan fisik dan mental, termasuk peningkatan risiko depresi dan kecemasan.",
            "Gangguan tidur seperti insomnia dapat menyebabkan penurunan fungsi harian dan kualitas hidup secara keseluruhan.",
            "Insomnia dapat mengganggu aktivitas sehari-hari dengan menimbulkan kelelahan, mood yang tidak stabil, dan menurunnya kinerja."
        ]
    },
    {
        "tag": "nilai_act",
        "pattern": [
            "Apa yang dimaksud dengan core values dalam ACT?",
            "Jelaskan peran core values dalam terapi ACT.",
            "Apa arti nilai-nilai inti dalam ACT?",
            "Mengapa core values penting dalam terapi ACT?",
            "Apa peran nilai dalam proses terapi ACT?",
            "Bisakah Anda menjelaskan tentang nilai dalam ACT?",
            "nilai dalam ACT, penjelasan?",
            "Boleh dong jelasin nilai dalam ACT pake bahasa gampang.",
            "Apa arti istilah nilai dalam ACT?",
            "nilai dalam ACT aja deh.",
            "Apa definisi dari nilai dalam ACT?",
            "nilai dalam ACT maksudnya?",
            "nilai dalam ACT?",
            "Jadi gini, nilai dalam ACT tuh apa ya?",
            "Tentang nilai dalam ACT?",
            "nilai dalam ACT itu apaan sih?",
            "Coba jelasin deh nilai dalam ACT.",
            "Apa yang dimaksud dengan nilai dalam ACT?",
            "Gue gak ngerti nilai dalam ACT, maksudnya apa?",
            "Tolong uraikan pengertian nilai dalam ACT."
        ],
        "response": [
            "Core values adalah nilai-nilai pribadi yang menjadi dasar bagi tindakan dan keputusan dalam terapi ACT.",
            "Dalam ACT, core values membantu individu menetapkan tujuan hidup yang bermakna dan mengarahkan tindakan mereka.",
            "Nilai-nilai inti merupakan panduan yang membantu pasien tetap fokus pada tujuan hidup meskipun mengalami kesulitan.",
            "Core values penting karena memberikan arah dan motivasi dalam mengatasi masalah insomnia melalui tindakan yang konsisten.",
            "Dalam terapi ACT, nilai-nilai inti digunakan untuk membantu pasien menemukan makna hidup dan mendorong tindakan yang mendukung tujuan tersebut."
        ]
    },
    {
        "tag": "committed_action",
        "pattern": [
            "Apa itu committed action dalam ACT?",
            "Jelaskan konsep committed action dalam terapi ACT.",
            "Apa yang dimaksud dengan committed action?",
            "Bagaimana committed action diterapkan dalam ACT?",
            "Apa peran committed action dalam terapi insomnia menggunakan ACT?",
            "Tentang committed action?",
            "Jadi gini, committed action tuh apa ya?",
            "Apa arti istilah committed action?",
            "Tolong uraikan pengertian committed action.",
            "committed action?",
            "committed action maksudnya?",
            "committed action itu apaan sih?",
            "Coba jelasin deh committed action.",
            "committed action, penjelasan?",
            "Apa definisi dari committed action?",
            "committed action aja deh.",
            "Bisakah Anda menjelaskan tentang committed action?",
            "Boleh dong jelasin committed action pake bahasa gampang.",
            "Gue gak ngerti committed action, maksudnya apa?",
            "Apa yang dimaksud dengan committed action?"
        ],
        "response": [
            "Committed action adalah tindakan nyata yang dilakukan pasien berdasarkan nilai-nilai mereka, meskipun menghadapi kesulitan.",
            "Dalam ACT, committed action mengacu pada upaya untuk melakukan tindakan yang konsisten dengan nilai pribadi meskipun ada hambatan.",
            "Committed action merupakan penerapan tindakan yang terarah dan konsisten dengan core values pasien.",
            "Konsep ini mendorong pasien untuk berkomitmen melakukan perubahan perilaku sesuai dengan tujuan hidup mereka.",
            "Committed action dalam ACT membantu pasien tetap fokus pada tindakan yang mendukung perbaikan kualitas hidup meskipun menghadapi tantangan tidur."
        ]
    },
    {
        "tag": "emotion_regulation",
        "pattern": [
            "Bagaimana regulasi emosi berperan dalam pengobatan insomnia?",
            "Apa itu emotion regulation dalam konteks insomnia?",
            "Jelaskan peran emotion regulation dalam mengatasi insomnia.",
            "Bagaimana emotion regulation dapat meningkatkan kualitas tidur?",
            "Apa hubungan antara regulasi emosi dan insomnia?",
            "Apa yang dimaksud dengan emotion regulation?",
            "emotion regulation, penjelasan?",
            "Boleh dong jelasin emotion regulation pake bahasa gampang.",
            "Apa arti istilah emotion regulation?",
            "emotion regulation itu apaan sih?",
            "emotion regulation maksudnya?",
            "Apa definisi dari emotion regulation?",
            "emotion regulation aja deh.",
            "Bisakah Anda menjelaskan tentang emotion regulation?",
            "Gue gak ngerti emotion regulation, maksudnya apa?",
            "Tentang emotion regulation?",
            "Tolong uraikan pengertian emotion regulation.",
            "Coba jelasin deh emotion regulation.",
            "Jadi gini, emotion regulation tuh apa ya?",
            "emotion regulation?"
        ],
        "response": [
            "Emotion regulation membantu mengelola perasaan negatif yang dapat mengganggu tidur, sehingga meningkatkan kualitas tidur.",
            "Dengan regulasi emosi yang baik, individu mampu mengurangi kecemasan dan stres yang sering memicu insomnia.",
            "Pengelolaan emosi yang efektif dapat menurunkan tingkat kecemasan dan memperbaiki pola tidur.",
            "Emotion regulation berperan penting dalam mengatasi insomnia dengan mengurangi reaktivitas emosional sebelum tidur.",
            "Mengatur emosi membantu pasien untuk mengurangi pikiran yang mengganggu dan mencapai tidur yang lebih nyenyak."
        ]
    },
    {
        "tag": "sleep_quality_measurement",
        "pattern": [
            "Bagaimana cara mengukur kualitas tidur?",
            "Apa metode untuk menilai sleep quality?",
            "Jelaskan cara pengukuran kualitas tidur.",
            "Bagaimana sleep quality diukur dalam penelitian insomnia?",
            "Apa saja parameter yang digunakan untuk mengukur kualitas tidur?",
            "Boleh dong jelasin pengukuran kualitas tidur pake bahasa gampang.",
            "Gue gak ngerti pengukuran kualitas tidur, maksudnya apa?",
            "Tolong uraikan pengertian pengukuran kualitas tidur.",
            "pengukuran kualitas tidur?",
            "Apa definisi dari pengukuran kualitas tidur?",
            "pengukuran kualitas tidur aja deh.",
            "Tentang pengukuran kualitas tidur?",
            "Bisakah Anda menjelaskan tentang pengukuran kualitas tidur?",
            "Coba jelasin deh pengukuran kualitas tidur.",
            "Apa arti istilah pengukuran kualitas tidur?",
            "Apa yang dimaksud dengan pengukuran kualitas tidur?",
            "pengukuran kualitas tidur, penjelasan?",
            "Jadi gini, pengukuran kualitas tidur tuh apa ya?",
            "pengukuran kualitas tidur maksudnya?",
            "pengukuran kualitas tidur itu apaan sih?"
        ],
        "response": [
            "Kualitas tidur diukur melalui self-report, sleep diary, dan kuesioner seperti PSQI dan ISI.",
            "Metode pengukuran kualitas tidur meliputi evaluasi subjektif dan pencatatan pola tidur harian.",
            "Sleep quality diukur dengan mengamati durasi, efisiensi, dan kepuasan tidur yang dilaporkan oleh pasien.",
            "Penilaian kualitas tidur sering menggunakan kuesioner seperti Pittsburgh Sleep Quality Index (PSQI).",
            "Evaluasi sleep quality melibatkan pengukuran durasi tidur, frekuensi terbangun, dan kepuasan tidur."
        ]
    },
    {
        "tag": "act_effectiveness",
        "pattern": [
            "Apakah ACT efektif untuk mengobati insomnia?",
            "Jelaskan efektivitas ACT dalam pengobatan insomnia.",
            "Bagaimana ACT membantu meningkatkan kualitas tidur?",
            "Apakah terapi ACT terbukti efektif untuk insomnia?",
            "Seberapa efektif ACT dalam mengatasi masalah tidur?",
            "Coba jelasin deh efektivitas ACT.",
            "Bisakah Anda menjelaskan tentang efektivitas ACT?",
            "Apa arti istilah efektivitas ACT?",
            "Tentang efektivitas ACT?",
            "efektivitas ACT maksudnya?",
            "efektivitas ACT itu apaan sih?",
            "Jadi gini, efektivitas ACT tuh apa ya?",
            "efektivitas ACT aja deh.",
            "efektivitas ACT, penjelasan?",
            "Gue gak ngerti efektivitas ACT, maksudnya apa?",
            "Apa definisi dari efektivitas ACT?",
            "Tolong uraikan pengertian efektivitas ACT.",
            "Boleh dong jelasin efektivitas ACT pake bahasa gampang.",
            "efektivitas ACT?",
            "Apa yang dimaksud dengan efektivitas ACT?"
        ],
        "response": [
            "Penelitian menunjukkan bahwa ACT dapat meningkatkan kualitas tidur dengan mengurangi experiential avoidance dan meningkatkan regulasi emosi.",
            "ACT efektif karena membantu pasien menerima pikiran negatif dan fokus pada tindakan yang mendukung nilai-nilai mereka.",
            "Terapi ACT terbukti dapat memperbaiki sleep quality dan mengurangi gejala insomnia pada beberapa studi.",
            "Efektivitas ACT terlihat dari perbaikan kualitas tidur dan penurunan tingkat kecemasan pada pasien insomnia.",
            "Bukti penelitian mendukung bahwa ACT merupakan pendekatan efektif untuk mengatasi insomnia melalui peningkatan fleksibilitas psikologis."
        ]
    },
    {
        "tag": "research_act_study",
        "pattern": [
            "Apa hasil penelitian mengenai ACT untuk insomnia?",
            "Jelaskan hasil studi intervensi ACT pada insomnia.",
            "Apa temuan utama dari penelitian ACT dan insomnia?",
            "Bagaimana hasil penelitian ACT dalam mengatasi insomnia?",
            "Apa yang ditemukan dalam studi ACT untuk meningkatkan tidur?",
            "Tolong uraikan pengertian penelitian ACT untuk insomnia.",
            "Apa arti istilah penelitian ACT untuk insomnia?",
            "Apa yang dimaksud dengan penelitian ACT untuk insomnia?",
            "Jadi gini, penelitian ACT untuk insomnia tuh apa ya?",
            "penelitian ACT untuk insomnia aja deh.",
            "Coba jelasin deh penelitian ACT untuk insomnia.",
            "penelitian ACT untuk insomnia, penjelasan?",
            "Gue gak ngerti penelitian ACT untuk insomnia, maksudnya apa?",
            "penelitian ACT untuk insomnia itu apaan sih?",
            "Boleh dong jelasin penelitian ACT untuk insomnia pake bahasa gampang.",
            "Tentang penelitian ACT untuk insomnia?",
            "Bisakah Anda menjelaskan tentang penelitian ACT untuk insomnia?",
            "Apa definisi dari penelitian ACT untuk insomnia?",
            "penelitian ACT untuk insomnia?",
            "penelitian ACT untuk insomnia maksudnya?"
        ],
        "response": [
            "Penelitian menunjukkan bahwa intervensi ACT dapat meningkatkan kualitas tidur dan mengurangi experiential avoidance.",
            "Studi menunjukkan adanya perbaikan signifikan dalam regulasi emosi dan kualitas tidur setelah terapi ACT.",
            "Temuan penelitian mendukung efektivitas ACT dalam meningkatkan sleep quality dan mengurangi gejala insomnia.",
            "Hasil studi ACT menunjukkan peningkatan kualitas tidur serta penurunan tingkat kecemasan pada pasien insomnia.",
            "Penelitian intervensi ACT menunjukkan bahwa terapi ini efektif dalam memperbaiki pola tidur dan pengelolaan emosi."
        ]
    },
    {
        "tag": "sleep_efficiency",
        "pattern": [
            "Apa itu sleep efficiency?",
            "Jelaskan pengertian sleep efficiency.",
            "Apa yang dimaksud dengan sleep efficiency dalam konteks tidur?",
            "Bagaimana cara mengukur sleep efficiency?",
            "Apa arti sleep efficiency dalam evaluasi tidur?",
            "sleep efficiency maksudnya?",
            "sleep efficiency aja deh.",
            "Apa yang dimaksud dengan sleep efficiency?",
            "sleep efficiency itu apaan sih?",
            "sleep efficiency, penjelasan?",
            "Apa arti istilah sleep efficiency?",
            "Bisakah Anda menjelaskan tentang sleep efficiency?",
            "Jadi gini, sleep efficiency tuh apa ya?",
            "Coba jelasin deh sleep efficiency.",
            "Tentang sleep efficiency?",
            "Boleh dong jelasin sleep efficiency pake bahasa gampang.",
            "Tolong uraikan pengertian sleep efficiency.",
            "Apa definisi dari sleep efficiency?",
            "sleep efficiency?",
            "Gue gak ngerti sleep efficiency, maksudnya apa?"
        ],
        "response": [
            "Sleep efficiency adalah persentase waktu yang dihabiskan tidur dibandingkan dengan waktu total di tempat tidur.",
            "Pengukuran sleep efficiency dilakukan dengan membandingkan total durasi tidur dengan waktu yang dihabiskan di tempat tidur.",
            "Sleep efficiency menunjukkan seberapa efisien seseorang menggunakan waktu di tempat tidur untuk tidur.",
            "Sleep efficiency diukur dengan rasio antara waktu tidur aktual dan waktu yang dihabiskan di tempat tidur.",
            "Secara sederhana, sleep efficiency adalah ukuran efektivitas tidur dalam periode waktu tertentu."
        ]
    },
    {
        "tag": "sleep_disorders_comorbidity",
        "pattern": [
            "Bagaimana insomnia berkaitan dengan gangguan kesehatan lainnya?",
            "Apa hubungan antara insomnia dan kondisi medis lain?",
            "Jelaskan kaitan insomnia dengan gangguan kesehatan mental dan fisik.",
            "Bagaimana insomnia dapat mempengaruhi kondisi kesehatan lain?",
            "Apa dampak insomnia terhadap kesehatan secara menyeluruh?",
            "Apa arti istilah komorbiditas insomnia?",
            "Tolong uraikan pengertian komorbiditas insomnia.",
            "Coba jelasin deh komorbiditas insomnia.",
            "komorbiditas insomnia itu apaan sih?",
            "Bisakah Anda menjelaskan tentang komorbiditas insomnia?",
            "Boleh dong jelasin komorbiditas insomnia pake bahasa gampang.",
            "Apa yang dimaksud dengan komorbiditas insomnia?",
            "Gue gak ngerti komorbiditas insomnia, maksudnya apa?",
            "Apa definisi dari komorbiditas insomnia?",
            "komorbiditas insomnia?",
            "komorbiditas insomnia maksudnya?",
            "Jadi gini, komorbiditas insomnia tuh apa ya?",
            "komorbiditas insomnia aja deh.",
            "Tentang komorbiditas insomnia?",
            "komorbiditas insomnia, penjelasan?"
        ],
        "response": [
            "Insomnia seringkali berkaitan dengan kondisi seperti depresi, kecemasan, dan gangguan kardiovaskular.",
            "Gangguan tidur seperti insomnia dapat memperburuk kondisi kesehatan mental dan fisik.",
            "Ada hubungan yang erat antara insomnia dengan peningkatan risiko gangguan kesehatan seperti depresi dan penyakit jantung.",
            "Insomnia dapat berdampak negatif pada kesehatan secara keseluruhan, termasuk kesehatan mental dan fisik.",
            "Penelitian menunjukkan bahwa insomnia dapat berkontribusi pada berbagai masalah kesehatan lainnya, baik mental maupun fisik."
        ]
    },
    {
        "tag": "factors_insomnia",
        "pattern": [
            "Apa faktor penyebab insomnia?",
            "Sebutkan faktor yang dapat menyebabkan insomnia.",
            "Apa saja penyebab umum insomnia?",
            "Jelaskan faktor-faktor yang berkontribusi pada insomnia.",
            "Apa yang dapat memicu terjadinya insomnia?",
            "faktor insomnia, penjelasan?",
            "Tolong uraikan pengertian faktor insomnia.",
            "Gue gak ngerti faktor insomnia, maksudnya apa?",
            "Tentang faktor insomnia?",
            "Apa definisi dari faktor insomnia?",
            "Jadi gini, faktor insomnia tuh apa ya?",
            "Apa yang dimaksud dengan faktor insomnia?",
            "Bisakah Anda menjelaskan tentang faktor insomnia?",
            "faktor insomnia aja deh.",
            "faktor insomnia?",
            "Apa arti istilah faktor insomnia?",
            "Boleh dong jelasin faktor insomnia pake bahasa gampang.",
            "faktor insomnia itu apaan sih?",
            "Coba jelasin deh faktor insomnia.",
            "faktor insomnia maksudnya?"
        ],
        "response": [
            "Insomnia dapat disebabkan oleh stres, kecemasan, kondisi medis, dan kebiasaan tidur yang buruk.",
            "Faktor penyebab insomnia meliputi faktor psikologis, lingkungan, dan kondisi kesehatan tertentu.",
            "Penyebab umum insomnia antara lain stres, depresi, dan gangguan kebiasaan tidur.",
            "Faktor seperti tekanan emosional dan lingkungan yang tidak mendukung dapat memicu insomnia.",
            "Insomnia sering kali dipicu oleh kombinasi faktor, mulai dari masalah emosional hingga kondisi medis."
        ]
    },
    {
        "tag": "barriers_cbti",
        "pattern": [
            "Apa hambatan umum dalam terapi CBT-I?",
            "Sebutkan kendala yang sering dihadapi dalam CBT-I.",
            "Apa saja hambatan dalam penerapan CBT-I?",
            "Jelaskan kendala yang bisa mengganggu efektivitas CBT-I.",
            "Apa yang menjadi tantangan dalam terapi CBT-I?",
            "Coba jelasin deh hambatan CBT-I.",
            "hambatan CBT-I aja deh.",
            "Apa yang dimaksud dengan hambatan CBT-I?",
            "Gue gak ngerti hambatan CBT-I, maksudnya apa?",
            "Tentang hambatan CBT-I?",
            "hambatan CBT-I?",
            "Bisakah Anda menjelaskan tentang hambatan CBT-I?",
            "hambatan CBT-I, penjelasan?",
            "Jadi gini, hambatan CBT-I tuh apa ya?",
            "hambatan CBT-I maksudnya?",
            "Boleh dong jelasin hambatan CBT-I pake bahasa gampang.",
            "Apa arti istilah hambatan CBT-I?",
            "hambatan CBT-I itu apaan sih?",
            "Tolong uraikan pengertian hambatan CBT-I.",
            "Apa definisi dari hambatan CBT-I?"
        ],
        "response": [
            "Hambatan CBT-I meliputi resistensi terhadap perubahan, kesulitan mengikuti jadwal tidur, dan drop-out pasien.",
            "Kendala dalam CBT-I sering muncul dari ketidaknyamanan dengan teknik sleep restriction dan stimulus control.",
            "Beberapa hambatan CBT-I adalah ketidakpatuhan terhadap rekomendasi dan overthinking tentang tidur.",
            "Tantangan dalam CBT-I termasuk motivasi yang rendah dan kesulitan menerapkan teknik yang direkomendasikan.",
            "Efektivitas CBT-I dapat terhambat oleh resistensi pasien terhadap perubahan perilaku tidur yang signifikan."
        ]
    },
    {
        "tag": "dropout_cbti",
        "pattern": [
            "Mengapa pasien sering dropout dari CBT-I?",
            "Apa penyebab pasien menghentikan CBT-I?",
            "Jelaskan alasan drop-out pada terapi CBT-I.",
            "Mengapa banyak pasien tidak menyelesaikan CBT-I?",
            "Apa faktor yang menyebabkan drop-out dalam CBT-I?",
            "Coba jelasin deh drop-out CBT-I.",
            "Apa yang dimaksud dengan drop-out CBT-I?",
            "Tentang drop-out CBT-I?",
            "Apa definisi dari drop-out CBT-I?",
            "Apa arti istilah drop-out CBT-I?",
            "drop-out CBT-I maksudnya?",
            "drop-out CBT-I itu apaan sih?",
            "Gue gak ngerti drop-out CBT-I, maksudnya apa?",
            "drop-out CBT-I, penjelasan?",
            "Jadi gini, drop-out CBT-I tuh apa ya?",
            "Tolong uraikan pengertian drop-out CBT-I.",
            "drop-out CBT-I?",
            "Bisakah Anda menjelaskan tentang drop-out CBT-I?",
            "drop-out CBT-I aja deh.",
            "Boleh dong jelasin drop-out CBT-I pake bahasa gampang."
        ],
        "response": [
            "Drop-out dalam CBT-I sering terjadi karena kesulitan mengikuti teknik seperti sleep restriction dan stimulus control.",
            "Pasien mungkin berhenti CBT-I karena merasa tidak nyaman dengan perubahan drastis dalam pola tidur.",
            "Alasan drop-out CBT-I termasuk frustrasi dan kurangnya motivasi untuk menerapkan rekomendasi terapi.",
            "Faktor drop-out dapat berupa kesulitan adaptasi terhadap teknik CBT-I yang menuntut disiplin tinggi.",
            "Banyak pasien menghentikan CBT-I karena mereka mengalami tantangan dalam menerapkan perubahan pola tidur yang disarankan."
        ]
    },
    {
        "tag": "act_as_alternative",
        "pattern": [
            "Apakah ACT dapat digunakan sebagai alternatif CBT-I?",
            "Bisakah ACT menggantikan CBT-I dalam pengobatan insomnia?",
            "Jelaskan peran ACT sebagai alternatif CBT-I.",
            "Apakah ACT efektif sebagai pengganti CBT-I?",
            "Bagaimana ACT dapat berfungsi sebagai alternatif terapi insomnia?",
            "ACT sebagai alternatif CBT-I itu apaan sih?",
            "Apa yang dimaksud dengan ACT sebagai alternatif CBT-I?",
            "Apa arti istilah ACT sebagai alternatif CBT-I?",
            "Boleh dong jelasin ACT sebagai alternatif CBT-I pake bahasa gampang.",
            "Jadi gini, ACT sebagai alternatif CBT-I tuh apa ya?",
            "Gue gak ngerti ACT sebagai alternatif CBT-I, maksudnya apa?",
            "Tolong uraikan pengertian ACT sebagai alternatif CBT-I.",
            "Bisakah Anda menjelaskan tentang ACT sebagai alternatif CBT-I?",
            "Coba jelasin deh ACT sebagai alternatif CBT-I.",
            "ACT sebagai alternatif CBT-I, penjelasan?",
            "ACT sebagai alternatif CBT-I?",
            "ACT sebagai alternatif CBT-I maksudnya?",
            "ACT sebagai alternatif CBT-I aja deh.",
            "Tentang ACT sebagai alternatif CBT-I?",
            "Apa definisi dari ACT sebagai alternatif CBT-I?"
        ],
        "response": [
            "ACT dapat digunakan sebagai alternatif atau tambahan untuk CBT-I, terutama bagi pasien yang kesulitan dengan teknik CBT-I.",
            "Beberapa studi menunjukkan bahwa ACT efektif sebagai pendekatan alternatif dalam mengatasi insomnia.",
            "ACT dapat menggantikan CBT-I bagi pasien yang tidak merespon baik terhadap terapi kognitif tradisional.",
            "Sebagai alternatif, ACT menawarkan pendekatan yang lebih menekankan penerimaan dan mindfulness dalam pengobatan insomnia.",
            "ACT terbukti efektif dan bisa dipertimbangkan sebagai alternatif bagi pasien yang mengalami kendala dengan CBT-I."
        ]
    },
    {
        "tag": "self_as_context",
        "pattern": [
            "Apa yang dimaksud dengan self as context dalam ACT?",
            "Jelaskan konsep self as context dalam terapi ACT.",
            "Apa arti self as context?",
            "Bagaimana self as context berperan dalam ACT?",
            "Apa peran self as context dalam terapi ACT?",
            "Apa arti istilah self as context?",
            "Apa yang dimaksud dengan self as context?",
            "self as context aja deh.",
            "self as context?",
            "Bisakah Anda menjelaskan tentang self as context?",
            "Coba jelasin deh self as context.",
            "Jadi gini, self as context tuh apa ya?",
            "Tolong uraikan pengertian self as context.",
            "Gue gak ngerti self as context, maksudnya apa?",
            "Tentang self as context?",
            "self as context maksudnya?",
            "self as context, penjelasan?",
            "Apa definisi dari self as context?",
            "self as context itu apaan sih?",
            "Boleh dong jelasin self as context pake bahasa gampang."
        ],
        "response": [
            "Self as context adalah kemampuan untuk mengamati diri sendiri secara objektif tanpa terjebak pada pengalaman internal.",
            "Konsep self as context dalam ACT membantu individu menyadari bahwa mereka lebih dari sekadar pikiran dan perasaan.",
            "Self as context memungkinkan seseorang untuk melihat pengalaman mereka dari sudut pandang yang lebih luas.",
            "Dalam ACT, self as context membantu pasien untuk tidak terlalu teridentifikasi dengan pikiran atau emosi negatif.",
            "Self as context adalah konsep yang mendorong individu untuk menyadari identitas diri yang lebih luas dan tidak hanya terbatas pada pengalaman internal."
        ]
    },
    {
        "tag": "sleep_questionnaires",
        "pattern": [
            "Apa itu sleep questionnaires?",
            "Jelaskan fungsi sleep questionnaires dalam diagnosis insomnia.",
            "Apa peran sleep questionnaires dalam evaluasi gangguan tidur?",
            "Bagaimana sleep questionnaires digunakan untuk menilai kualitas tidur?",
            "Apa manfaat sleep questionnaires dalam pengobatan insomnia?",
            "sleep questionnaires, penjelasan?",
            "Boleh dong jelasin sleep questionnaires pake bahasa gampang.",
            "Tentang sleep questionnaires?",
            "sleep questionnaires aja deh.",
            "Gue gak ngerti sleep questionnaires, maksudnya apa?",
            "Apa yang dimaksud dengan sleep questionnaires?",
            "Bisakah Anda menjelaskan tentang sleep questionnaires?",
            "Jadi gini, sleep questionnaires tuh apa ya?",
            "Apa arti istilah sleep questionnaires?",
            "Apa definisi dari sleep questionnaires?",
            "sleep questionnaires?",
            "Tolong uraikan pengertian sleep questionnaires.",
            "sleep questionnaires itu apaan sih?",
            "Coba jelasin deh sleep questionnaires.",
            "sleep questionnaires maksudnya?"
        ],
        "response": [
            "Sleep questionnaires adalah alat untuk mengukur dan mengevaluasi kualitas serta gejala insomnia.",
            "Alat ini digunakan untuk mengumpulkan data subjektif tentang pola tidur dan kualitas tidur pasien.",
            "Sleep questionnaires membantu dokter menilai tingkat keparahan insomnia dan merencanakan intervensi terapi.",
            "Dengan sleep questionnaires, pasien dapat melaporkan pengalaman tidur mereka secara terstruktur.",
            "Fungsi sleep questionnaires adalah untuk memberikan gambaran mengenai gangguan tidur dan dampaknya pada kehidupan sehari-hari."
        ]
    },
    {
        "tag": "benefit_act",
        "pattern": [
            "Apa manfaat utama ACT dalam mengobati insomnia?",
            "Jelaskan keuntungan menggunakan ACT untuk insomnia.",
            "Bagaimana ACT bermanfaat bagi pasien insomnia?",
            "Apa saja kelebihan terapi ACT untuk mengatasi masalah tidur?",
            "Mengapa ACT dianggap efektif dalam mengatasi insomnia?",
            "Tentang manfaat ACT?",
            "Tolong uraikan pengertian manfaat ACT.",
            "Coba jelasin deh manfaat ACT.",
            "Bisakah Anda menjelaskan tentang manfaat ACT?",
            "Apa yang dimaksud dengan manfaat ACT?",
            "Boleh dong jelasin manfaat ACT pake bahasa gampang.",
            "Apa definisi dari manfaat ACT?",
            "manfaat ACT maksudnya?",
            "Jadi gini, manfaat ACT tuh apa ya?",
            "Apa arti istilah manfaat ACT?",
            "manfaat ACT itu apaan sih?",
            "Gue gak ngerti manfaat ACT, maksudnya apa?",
            "manfaat ACT?",
            "manfaat ACT aja deh.",
            "manfaat ACT, penjelasan?"
        ],
        "response": [
            "ACT membantu meningkatkan penerimaan terhadap pengalaman negatif dan meningkatkan fleksibilitas psikologis, sehingga kualitas tidur membaik.",
            "Dengan ACT, pasien belajar mengelola pikiran dan emosi secara lebih efektif yang berdampak positif pada tidur.",
            "Manfaat ACT antara lain mengurangi kecemasan dan meningkatkan kemampuan untuk menerima gangguan tidur.",
            "ACT memberikan pendekatan yang lebih holistik dengan fokus pada penerimaan dan komitmen terhadap nilai pribadi.",
            "Keuntungan utama ACT adalah membantu pasien mengurangi perjuangan melawan insomnia dan fokus pada tindakan yang mendukung kualitas hidup."
        ]
    },
    {
        "tag": "cbt_i_outcomes",
        "pattern": [
            "Apa saja hasil yang diharapkan dari CBT-I?",
            "Jelaskan outcome terapi CBT-I untuk insomnia.",
            "Apa efek positif dari terapi CBT-I pada tidur?",
            "Bagaimana CBT-I dapat meningkatkan kualitas tidur?",
            "Apa hasil penelitian tentang efektivitas CBT-I?",
            "Apa definisi dari hasil CBT-I?",
            "Tolong uraikan pengertian hasil CBT-I.",
            "Jadi gini, hasil CBT-I tuh apa ya?",
            "hasil CBT-I?",
            "hasil CBT-I, penjelasan?",
            "Tentang hasil CBT-I?",
            "Gue gak ngerti hasil CBT-I, maksudnya apa?",
            "hasil CBT-I aja deh.",
            "Apa arti istilah hasil CBT-I?",
            "hasil CBT-I maksudnya?",
            "Bisakah Anda menjelaskan tentang hasil CBT-I?",
            "hasil CBT-I itu apaan sih?",
            "Boleh dong jelasin hasil CBT-I pake bahasa gampang.",
            "Apa yang dimaksud dengan hasil CBT-I?",
            "Coba jelasin deh hasil CBT-I."
        ],
        "response": [
            "CBT-I diharapkan dapat meningkatkan efisiensi tidur, mengurangi waktu terjaga, dan memperbaiki kualitas tidur secara keseluruhan.",
            "Outcome CBT-I meliputi peningkatan durasi tidur dan penurunan kecemasan terkait tidur.",
            "Terapi CBT-I memberikan efek positif seperti pengurangan gejala insomnia dan peningkatan mood.",
            "Hasil CBT-I menunjukkan perbaikan dalam pola tidur dan penurunan waktu terbangun di malam hari.",
            "Penelitian menunjukkan bahwa CBT-I efektif dalam mengurangi gangguan tidur dan meningkatkan kualitas hidup pasien."
        ]
    },
    {
        "tag": "act_vs_pharma",
        "pattern": [
            "Bagaimana perbandingan ACT dengan pengobatan farmakologis untuk insomnia?",
            "Apa kelebihan ACT dibandingkan obat tidur?",
            "Jelaskan perbandingan efektivitas antara ACT dan pengobatan farmakologis.",
            "Bagaimana ACT berbeda dari pengobatan insomnia berbasis obat?",
            "Apa perbedaan antara pendekatan ACT dan obat tidur dalam mengatasi insomnia?",
            "ACT dan obat tidur maksudnya?",
            "Jadi gini, ACT dan obat tidur tuh apa ya?",
            "ACT dan obat tidur, penjelasan?",
            "Apa arti istilah ACT dan obat tidur?",
            "Boleh dong jelasin ACT dan obat tidur pake bahasa gampang.",
            "Coba jelasin deh ACT dan obat tidur.",
            "ACT dan obat tidur?",
            "Tentang ACT dan obat tidur?",
            "Apa definisi dari ACT dan obat tidur?",
            "ACT dan obat tidur aja deh.",
            "Bisakah Anda menjelaskan tentang ACT dan obat tidur?",
            "ACT dan obat tidur itu apaan sih?",
            "Tolong uraikan pengertian ACT dan obat tidur.",
            "Apa yang dimaksud dengan ACT dan obat tidur?",
            "Gue gak ngerti ACT dan obat tidur, maksudnya apa?"
        ],
        "response": [
            "ACT menawarkan pendekatan non-farmakologis yang mengatasi akar penyebab insomnia, sedangkan obat tidur hanya bersifat simptomatik.",
            "Keunggulan ACT adalah tidak menyebabkan ketergantungan, berbeda dengan pengobatan farmakologis yang bersifat sementara.",
            "ACT fokus pada perubahan perilaku dan penerimaan, sementara obat tidur bekerja dengan menekan gejala insomnia.",
            "Pendekatan ACT lebih holistik dan berkelanjutan dibandingkan pengobatan farmakologis yang memiliki efek samping.",
            "ACT dapat memberikan perbaikan jangka panjang dalam kualitas tidur, sedangkan obat tidur hanya memberikan solusi sementara."
        ]
    },
    {
        "tag": "role_act_emotion",
        "pattern": [
            "Bagaimana ACT membantu dalam mengelola emosi pada pasien insomnia?",
            "Apa peran ACT dalam regulasi emosi untuk insomnia?",
            "Jelaskan cara ACT mengatasi gangguan emosi terkait insomnia.",
            "Bagaimana ACT berkontribusi pada pengelolaan emosi yang mempengaruhi tidur?",
            "Apa yang dilakukan ACT untuk membantu pasien mengatur emosi agar tidur lebih baik?",
            "peran ACT dalam emosi maksudnya?",
            "Tentang peran ACT dalam emosi?",
            "Bisakah Anda menjelaskan tentang peran ACT dalam emosi?",
            "Jadi gini, peran ACT dalam emosi tuh apa ya?",
            "Apa definisi dari peran ACT dalam emosi?",
            "Gue gak ngerti peran ACT dalam emosi, maksudnya apa?",
            "Tolong uraikan pengertian peran ACT dalam emosi.",
            "peran ACT dalam emosi, penjelasan?",
            "peran ACT dalam emosi itu apaan sih?",
            "peran ACT dalam emosi aja deh.",
            "Coba jelasin deh peran ACT dalam emosi.",
            "Apa arti istilah peran ACT dalam emosi?",
            "Boleh dong jelasin peran ACT dalam emosi pake bahasa gampang.",
            "Apa yang dimaksud dengan peran ACT dalam emosi?",
            "peran ACT dalam emosi?"
        ],
        "response": [
            "ACT membantu pasien untuk menerima emosi negatif tanpa melawan, sehingga mengurangi stres dan meningkatkan kualitas tidur.",
            "Dengan ACT, pasien belajar mengelola reaksi emosional yang berlebihan, yang sering kali mengganggu tidur.",
            "Pendekatan ACT mengajarkan penerimaan emosi sehingga pasien tidak terjebak dalam siklus overthinking sebelum tidur.",
            "ACT mendorong regulasi emosi melalui mindfulness dan penerimaan, yang berkontribusi pada perbaikan pola tidur.",
            "Melalui ACT, pasien dapat belajar untuk melepaskan beban emosional yang mengganggu tidur dan meningkatkan relaksasi."
        ]
    },
    {
        "tag": "act_intervention_methods",
        "pattern": [
            "Metode intervensi apa saja yang digunakan dalam ACT untuk insomnia?",
            "Jelaskan metode yang digunakan dalam intervensi ACT untuk masalah tidur.",
            "Apa saja teknik yang diterapkan dalam terapi ACT untuk insomnia?",
            "Metode apa yang biasa digunakan dalam ACT untuk mengatasi insomnia?",
            "Sebutkan intervensi yang digunakan dalam ACT untuk pengobatan insomnia.",
            "Coba jelasin deh metode ACT.",
            "Jadi gini, metode ACT tuh apa ya?",
            "metode ACT?",
            "Boleh dong jelasin metode ACT pake bahasa gampang.",
            "Tolong uraikan pengertian metode ACT.",
            "metode ACT aja deh.",
            "Apa yang dimaksud dengan metode ACT?",
            "metode ACT, penjelasan?",
            "Gue gak ngerti metode ACT, maksudnya apa?",
            "Apa definisi dari metode ACT?",
            "metode ACT maksudnya?",
            "metode ACT itu apaan sih?",
            "Bisakah Anda menjelaskan tentang metode ACT?",
            "Tentang metode ACT?",
            "Apa arti istilah metode ACT?"
        ],
        "response": [
            "Metode dalam ACT meliputi latihan mindfulness, teknik cognitive defusion, dan identifikasi nilai pribadi.",
            "Intervensi ACT biasanya melibatkan latihan penerimaan, mindfulness, dan tindakan yang konsisten dengan nilai-nilai inti.",
            "Teknik yang digunakan dalam ACT mencakup latihan kesadaran penuh, penerimaan, dan komitmen pada tindakan positif.",
            "ACT menggunakan metode seperti latihan meditasi, defusi kognitif, dan klarifikasi nilai untuk mengatasi insomnia.",
            "Intervensi ACT terdiri dari berbagai teknik, termasuk mindfulness, penerimaan pengalaman, dan committed action."
        ]
    },
    {
        "tag": "insomnia_risk_factors",
        "pattern": [
            "Apa faktor risiko yang dapat memicu insomnia?",
            "Jelaskan faktor-faktor risiko yang berkontribusi pada insomnia.",
            "Apa saja faktor risiko utama untuk mengalami insomnia?",
            "Faktor apa saja yang meningkatkan kemungkinan terjadinya insomnia?",
            "Apa penyebab risiko tinggi untuk insomnia?",
            "Jadi gini, faktor risiko insomnia tuh apa ya?",
            "Gue gak ngerti faktor risiko insomnia, maksudnya apa?",
            "Apa arti istilah faktor risiko insomnia?",
            "Apa definisi dari faktor risiko insomnia?",
            "Coba jelasin deh faktor risiko insomnia.",
            "Tolong uraikan pengertian faktor risiko insomnia.",
            "Tentang faktor risiko insomnia?",
            "Boleh dong jelasin faktor risiko insomnia pake bahasa gampang.",
            "faktor risiko insomnia, penjelasan?",
            "faktor risiko insomnia?",
            "Bisakah Anda menjelaskan tentang faktor risiko insomnia?",
            "faktor risiko insomnia aja deh.",
            "Apa yang dimaksud dengan faktor risiko insomnia?",
            "faktor risiko insomnia itu apaan sih?",
            "faktor risiko insomnia maksudnya?"
        ],
        "response": [
            "Faktor risiko insomnia meliputi stres, kecemasan, gangguan kesehatan, dan kebiasaan tidur yang buruk.",
            "Risiko insomnia dapat meningkat karena faktor psikologis, lingkungan, dan kondisi medis tertentu.",
            "Stres, depresi, dan lingkungan yang tidak kondusif adalah beberapa faktor risiko utama insomnia.",
            "Faktor seperti kecemasan dan kebiasaan tidak sehat sebelum tidur dapat meningkatkan risiko insomnia.",
            "Insomnia sering dipicu oleh kombinasi faktor, termasuk tekanan emosional dan kebiasaan tidur yang buruk."
        ]
    },
    {
        "tag": "role_act_mindfulness",
        "pattern": [
            "Bagaimana peran mindfulness dalam ACT membantu pasien insomnia?",
            "Apa manfaat mindfulness dalam terapi ACT untuk insomnia?",
            "Jelaskan kontribusi mindfulness dalam intervensi ACT untuk mengatasi insomnia.",
            "Bagaimana mindfulness diterapkan dalam ACT untuk meningkatkan kualitas tidur?",
            "Apa pengaruh latihan mindfulness dalam ACT pada pasien insomnia?",
            "Tolong uraikan pengertian mindfulness dalam ACT.",
            "mindfulness dalam ACT aja deh.",
            "mindfulness dalam ACT maksudnya?",
            "Tentang mindfulness dalam ACT?",
            "Apa yang dimaksud dengan mindfulness dalam ACT?",
            "Boleh dong jelasin mindfulness dalam ACT pake bahasa gampang.",
            "Apa definisi dari mindfulness dalam ACT?",
            "mindfulness dalam ACT, penjelasan?",
            "Gue gak ngerti mindfulness dalam ACT, maksudnya apa?",
            "Coba jelasin deh mindfulness dalam ACT.",
            "mindfulness dalam ACT itu apaan sih?",
            "Bisakah Anda menjelaskan tentang mindfulness dalam ACT?",
            "mindfulness dalam ACT?",
            "Apa arti istilah mindfulness dalam ACT?",
            "Jadi gini, mindfulness dalam ACT tuh apa ya?"
        ],
        "response": [
            "Mindfulness dalam ACT membantu pasien menyadari pikiran dan emosi tanpa penilaian, sehingga mengurangi stres yang mengganggu tidur.",
            "Dengan latihan mindfulness, pasien dapat lebih fokus pada saat ini, yang berkontribusi pada perbaikan kualitas tidur.",
            "Mindfulness membantu mengurangi overthinking sebelum tidur dengan mendorong penerimaan atas pengalaman internal.",
            "Latihan mindfulness dalam ACT memungkinkan pasien untuk mengurangi kecemasan dan meningkatkan relaksasi sebelum tidur.",
            "Mindfulness sebagai bagian dari ACT berperan penting dalam membantu pasien mencapai keadaan tenang yang mendukung tidur."
        ]
    },
    {
        "tag": "act_vs_mindfulness",
        "pattern": [
            "Apa perbedaan antara ACT dan latihan mindfulness?",
            "Bagaimana ACT berbeda dari sekedar latihan mindfulness?",
            "Jelaskan perbedaan pendekatan ACT dan mindfulness dalam mengatasi insomnia.",
            "Apa yang membedakan terapi ACT dengan praktik mindfulness?",
            "Bagaimana perbedaan antara ACT dan mindfulness dalam konteks pengobatan insomnia?",
            "Apa arti istilah ACT dan mindfulness?",
            "Apa definisi dari ACT dan mindfulness?",
            "Tentang ACT dan mindfulness?",
            "ACT dan mindfulness maksudnya?",
            "Gue gak ngerti ACT dan mindfulness, maksudnya apa?",
            "Apa yang dimaksud dengan ACT dan mindfulness?",
            "Jadi gini, ACT dan mindfulness tuh apa ya?",
            "ACT dan mindfulness, penjelasan?",
            "Bisakah Anda menjelaskan tentang ACT dan mindfulness?",
            "ACT dan mindfulness itu apaan sih?",
            "Coba jelasin deh ACT dan mindfulness.",
            "Boleh dong jelasin ACT dan mindfulness pake bahasa gampang.",
            "ACT dan mindfulness?",
            "Tolong uraikan pengertian ACT dan mindfulness.",
            "ACT dan mindfulness aja deh."
        ],
        "response": [
            "ACT mencakup mindfulness sebagai salah satu komponennya, namun juga melibatkan penerimaan, defusi kognitif, dan komitmen terhadap nilai.",
            "Sementara mindfulness fokus pada kesadaran saat ini, ACT mengintegrasikan berbagai teknik untuk mencapai perubahan perilaku.",
            "ACT merupakan terapi yang lebih komprehensif dibandingkan hanya latihan mindfulness saja, dengan pendekatan yang lebih terstruktur.",
            "Perbedaan utama adalah ACT menggabungkan mindfulness dengan teknik-teknik lain untuk mengatasi masalah tidur secara menyeluruh.",
            "ACT lebih luas daripada mindfulness karena mencakup aspek penerimaan dan tindakan berdasarkan nilai-nilai pribadi."
        ]
    },
    {
        "tag": "act_long_term_effects",
        "pattern": [
            "Apa efek jangka panjang dari terapi ACT untuk insomnia?",
            "Jelaskan dampak jangka panjang ACT pada kualitas tidur.",
            "Bagaimana ACT mempengaruhi tidur dalam jangka panjang?",
            "Apa manfaat jangka panjang dari intervensi ACT untuk insomnia?",
            "Apa efek berkelanjutan ACT dalam pengobatan insomnia?",
            "Apa definisi dari efek jangka panjang ACT?",
            "efek jangka panjang ACT itu apaan sih?",
            "Bisakah Anda menjelaskan tentang efek jangka panjang ACT?",
            "Gue gak ngerti efek jangka panjang ACT, maksudnya apa?",
            "efek jangka panjang ACT?",
            "Tentang efek jangka panjang ACT?",
            "Apa arti istilah efek jangka panjang ACT?",
            "Tolong uraikan pengertian efek jangka panjang ACT.",
            "efek jangka panjang ACT maksudnya?",
            "Coba jelasin deh efek jangka panjang ACT.",
            "efek jangka panjang ACT, penjelasan?",
            "efek jangka panjang ACT aja deh.",
            "Jadi gini, efek jangka panjang ACT tuh apa ya?",
            "Boleh dong jelasin efek jangka panjang ACT pake bahasa gampang.",
            "Apa yang dimaksud dengan efek jangka panjang ACT?"
        ],
        "response": [
            "Penelitian menunjukkan bahwa ACT dapat menghasilkan perbaikan kualitas tidur yang bertahan lama setelah intervensi.",
            "Efek jangka panjang ACT meliputi peningkatan fleksibilitas psikologis dan penurunan gejala insomnia secara stabil.",
            "ACT terbukti mampu mempertahankan perbaikan tidur bahkan setelah periode terapi selesai.",
            "Manfaat jangka panjang ACT termasuk pengurangan kecemasan dan peningkatan kualitas hidup yang berkelanjutan.",
            "Intervensi ACT dapat memberikan efek positif yang bertahan lama pada pola tidur dan pengelolaan emosi."
        ]
    },
    {
        "tag": "polysomnography_role",
        "pattern": [
            "Apa peran polysomnography dalam diagnosis insomnia?",
            "Jelaskan fungsi polysomnography untuk insomnia.",
            "Bagaimana polysomnography digunakan dalam evaluasi tidur?",
            "Apa manfaat penggunaan polysomnography dalam diagnosis insomnia?",
            "Apa arti polysomnography dalam pengobatan insomnia?",
            "Jadi gini, polysomnography tuh apa ya?",
            "Gue gak ngerti polysomnography, maksudnya apa?",
            "Tolong uraikan pengertian polysomnography.",
            "polysomnography maksudnya?",
            "Bisakah Anda menjelaskan tentang polysomnography?",
            "polysomnography, penjelasan?",
            "Tentang polysomnography?",
            "polysomnography?",
            "polysomnography aja deh.",
            "Apa definisi dari polysomnography?",
            "Apa yang dimaksud dengan polysomnography?",
            "Boleh dong jelasin polysomnography pake bahasa gampang.",
            "Coba jelasin deh polysomnography.",
            "polysomnography itu apaan sih?",
            "Apa arti istilah polysomnography?"
        ],
        "response": [
            "Polysomnography digunakan untuk menilai parameter tidur secara objektif dan membantu mendeteksi gangguan tidur lain.",
            "Fungsi polysomnography adalah untuk mengukur aktivitas otak, pernapasan, dan gerakan tubuh selama tidur.",
            "Polysomnography membantu dalam diagnosis dengan menyediakan data objektif tentang pola tidur pasien.",
            "Penggunaan polysomnography penting untuk mengidentifikasi kondisi tidur lain yang mungkin menyertai insomnia.",
            "Polysomnography adalah alat diagnostik yang memberikan gambaran menyeluruh tentang aktivitas fisiologis saat tidur."
        ]
    },
    {
        "tag": "act_emotion_change",
        "pattern": [
            "Bagaimana ACT mempengaruhi perubahan emosi pada pasien insomnia?",
            "Apa dampak ACT terhadap pengelolaan emosi dalam insomnia?",
            "Jelaskan perubahan emosi yang terjadi setelah terapi ACT.",
            "Bagaimana ACT membantu mengubah respons emosional terhadap insomnia?",
            "Apa peran ACT dalam merubah pola emosi pasien insomnia?",
            "perubahan emosi dengan ACT, penjelasan?",
            "Coba jelasin deh perubahan emosi dengan ACT.",
            "Bisakah Anda menjelaskan tentang perubahan emosi dengan ACT?",
            "Tentang perubahan emosi dengan ACT?",
            "perubahan emosi dengan ACT itu apaan sih?",
            "Jadi gini, perubahan emosi dengan ACT tuh apa ya?",
            "perubahan emosi dengan ACT?",
            "Apa yang dimaksud dengan perubahan emosi dengan ACT?",
            "Apa definisi dari perubahan emosi dengan ACT?",
            "Tolong uraikan pengertian perubahan emosi dengan ACT.",
            "Apa arti istilah perubahan emosi dengan ACT?",
            "Gue gak ngerti perubahan emosi dengan ACT, maksudnya apa?",
            "perubahan emosi dengan ACT maksudnya?",
            "perubahan emosi dengan ACT aja deh.",
            "Boleh dong jelasin perubahan emosi dengan ACT pake bahasa gampang."
        ],
        "response": [
            "ACT membantu pasien menerima dan mengelola emosi negatif, sehingga respons emosional terhadap insomnia menjadi lebih adaptif.",
            "Dengan ACT, pasien belajar mengubah pola pikir yang menimbulkan reaksi emosional negatif, sehingga meningkatkan kualitas tidur.",
            "Terapi ACT dapat meredakan reaksi emosional yang berlebihan terhadap insomnia dengan meningkatkan fleksibilitas emosional.",
            "ACT memfasilitasi perubahan emosi melalui penerimaan dan mindfulness, yang berkontribusi pada perbaikan tidur.",
            "Efek ACT meliputi penurunan intensitas emosi negatif dan peningkatan kemampuan mengelola stres yang mempengaruhi tidur."
        ]
    },
    {
        "tag": "orexin_antagonists",
        "pattern": [
            "Apa itu orexin receptor antagonists dalam pengobatan insomnia?",
            "Jelaskan peran orexin antagonists dalam terapi insomnia.",
            "Apa manfaat penggunaan orexin receptor antagonists untuk insomnia?",
            "Bagaimana orexin antagonists bekerja dalam mengatasi insomnia?",
            "Apa yang dimaksud dengan orexin receptor antagonists dalam pengobatan tidur?",
            "orexin antagonists maksudnya?",
            "Coba jelasin deh orexin antagonists.",
            "Bisakah Anda menjelaskan tentang orexin antagonists?",
            "Gue gak ngerti orexin antagonists, maksudnya apa?",
            "Apa arti istilah orexin antagonists?",
            "orexin antagonists itu apaan sih?",
            "orexin antagonists aja deh.",
            "orexin antagonists, penjelasan?",
            "Jadi gini, orexin antagonists tuh apa ya?",
            "Boleh dong jelasin orexin antagonists pake bahasa gampang.",
            "Apa definisi dari orexin antagonists?",
            "Tentang orexin antagonists?",
            "Tolong uraikan pengertian orexin antagonists.",
            "Apa yang dimaksud dengan orexin antagonists?",
            "orexin antagonists?"
        ],
        "response": [
            "Orexin receptor antagonists adalah obat yang bekerja dengan menghambat aktivitas orexin, sehingga membantu menginduksi tidur.",
            "Obat ini berfungsi untuk mengurangi stimulasi yang membuat seseorang tetap terjaga, mendukung pengobatan insomnia.",
            "Orexin antagonists membantu mengatasi insomnia dengan mengurangi rangsangan yang menghambat proses tidur.",
            "Penggunaan orexin receptor antagonists dapat meningkatkan peluang tidur dengan menekan sistem rangsang wakefulness.",
            "Obat ini merupakan salah satu pendekatan farmakologis untuk insomnia yang bekerja dengan menghambat sinyal orexin."
        ]
    },
    {
        "tag": "greeting",
        "pattern": [
            "Hai, apa kabar?",
            "Halo chatbot!",
            "Pagi, bisa bantu saya?",
            "Selamat siang!",
            "Assalamualaikum",
            "Halo, saya baru di sini",
            "Hi, aku butuh info nih",
            "Apa kabar bot?",
            "Pagi-pagi nanya ya boleh?",
            "Selamat malam, ada waktu?",
            "Hai, boleh ngobrol?",
            "Halo, siap bantu?",
            "Halo dulu dong",
            "Hai kamu siapa sih?",
            "Woi, bot!"
        ],
        "response": [
            "Halo! Ada yang bisa saya bantu?",
            "Hai! Apa kabar? Siap membantu kamu nih.",
            "Selamat datang! Ada yang bisa saya bantu hari ini?",
            "Hello! Butuh informasi seputar insomnia? Aku siap bantu.",
            "Hai, senang bertemu denganmu. Yuk ngobrol!"
        ]
    },
    {
        "tag": "thank_you",
        "pattern": [
            "Terima kasih ya!",
            "Thanks a lot!",
            "Makasih infonya",
            "Wah makasih banyak ya",
            "Udah jelas, makasih",
            "Oke, makasih ya",
            "Makasih ya bot",
            "Terima kasih atas jawabannya",
            "Thanks, sangat membantu",
            "Oke sip, terima kasih",
            "Keren, makasih banget",
            "Tengkyu!",
            "Alhamdulillah, makasih jawabannya",
            "Gak nyangka kamu jawab, thanks!",
            "Mantap, makasih banyak"
        ],
        "response": [
            "Sama-sama! Senang bisa membantu.",
            "Dengan senang hati",
            "Terima kasih kembali! Jangan sungkan kalau ada pertanyaan lain.",
            "Senang bisa bantu kamu!",
            "Kapan pun kamu butuh, aku di sini kok!"
        ]
    },
    {
        "tag": "identity_bot",
        "pattern": [
            "Kamu siapa sih?",
            "Bot ini namanya siapa?",
            "Apa kamu manusia?",
            "Kamu AI ya?",
            "Kamu ini robot atau gimana?",
            "Bot ini punya siapa?",
            "Lu bot apa manusia?",
            "Siapa pembuatmu?",
            "Lu bisa mikir gak?",
            "Dari mana kamu berasal?",
            "Apa kamu punya emosi?",
            "Boleh tahu kamu siapa?",
            "Kamu kerja di mana?",
            "Chatbot ini gunanya apa?",
            "Kenalin dong, kamu siapa?"
        ],
        "response": [
            "Saya adalah asisten virtual yang dirancang untuk membantu menjawab pertanyaan Anda tentang insomnia dan terapi terkait.",
            "Aku bot pintar yang siap menemani kamu memahami masalah tidur kamu.",
            "Saya bukan manusia, tapi saya di sini untuk membantu kamu sebisa mungkin!",
            "Aku adalah program AI yang dibuat untuk memberikan informasi seputar insomnia.",
            "Kamu bisa anggap aku sebagai teman ngobrol virtual kamu soal gangguan tidur."
        ]
    },
    {
        "tag": "help_request",
        "pattern": [
            "Tolong bantu saya dong",
            "Aku butuh bantuan nih",
            "Bisa tolong bantu?",
            "Saya bingung, bisa bantu?",
            "Boleh minta tolong?",
            "Mohon bantuannya ya",
            "Tolong ya bot",
            "Saya perlu informasi tentang insomnia",
            "Bantuin dong ngerti soal ACT",
            "Bisa bantu saya cari jawaban?",
            "Gimana cara ngerti CBT-I ya?",
            "Bingung nih, tolongin dong",
            "Kamu bisa bantu saya gak?",
            "Butuh pencerahan nih",
            "Gue gak ngerti, tolong dong"
        ],
        "response": [
            "Tentu, saya akan berusaha membantu sebisa mungkin. Pertanyaan apa yang ingin Anda ajukan?",
            "Oke, tenang aja. Ceritain dulu masalahnya ya.",
            "Tentu! Aku siap bantu kamu. Kamu bingung soal apa?",
            "Yuk kita bahas bareng-bareng. Ceritakan masalahmu.",
            "Dengan senang hati! Silakan tanyakan apa pun yang kamu ingin tahu."
        ]
    }
]